---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyRevolveAxisWarn
source: html/0a3484ab-9df4-6efc-cd16-23d23db4220c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyRevolveAxisWarn Property

The axis cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyRevolveAxisWarn { get; }
```